<html><head><meta charset="UTF-8"/><title>L'avenir de ciboulette</title><meta name="description"/><link rel="stylesheet" href="/styles/style.css"/><link rel="shortcut icon" type="image/png" href="/favicon.png"/><meta name="viewport" content="width=device-width, initial-scale=1"/><meta name="twitter:site" content="@ciboulette.net"/><meta name="twitter:title" content="ciboulette.net"/><meta name="twitter:creator" content="@RenanLeCaro"/><meta name="twitter:image" content="https://i.imgur.com/KXzgfoT.png"/><meta property="og:title" content="ciboulette.net"/><meta property="og:type" content="website"/><meta property="og:url" content="https://ciboulette.net/"/><meta property="og:image" content="https://i.imgur.com/KXzgfoT.png"/><meta property="og:description" content="Ciboulette.net est un système de Commande en ligne dédiés aux maraichers en vente directe."/><meta property="og:site_name" content="ciboulette.net"/><meta property="fb:admins" content="1136448477"/></head><body> <div class="blogPost"><div class="content"><h1>L'avenir de ciboulette</h1><div class="intro">Nouveau tarif plus durable à 300€ / ans, fonctions dépoyées dans les derniers mois mais non plubliées</div><html><body><h2>Changement de prix</h2><p>Ciboulette augment ses prix, de 14.90&euro; / mois a 25&euro; / mois, payable uniquement par ann&eacute;e compl&egrave;te, pour que maintenir le syst&egrave;me soit un petit peu plus rentable. Au tarif actuel, avec seulement 7 mara&icirc;chers, les 50&euro;/b&eacute;n&eacute;fice par mois ne justifient pas le maintient de l&apos;application en fonctionnement de mon cot&eacute;.</p><p>Mon but devient d&rsquo;acqu&eacute;rir progressivement une base d&apos;utilisateur d&apos;environ 30 mara&icirc;chers, ce qui devrait produire 500&euro;/mois, un salaire confortable si on vie en Ukraine (ma prochaine destination pour 2021)</p><p>J&apos;ai d&eacute;couvert r&eacute;cemment que ciboulette tourne beaucoup mieux, et pour moins cher, quand l&apos;appli est h&eacute;berg&eacute;e sur <a href="https://www.digitalocean.com/">digitalocean</a>. &Ccedil;a rends possible des d&eacute;ploiements multiples de l&apos;appli, ou le crash d&apos;une instance n&apos;aura pas d&rsquo;impact sur la seconde, ce qui r&eacute;duit le stress lors des d&eacute;ploiements.</p><h2>Objectif pour la seconde partie de 2020</h2><p>Pour les mois qui viennent, je souhaite atteindre les objectifs suivants, a effectuer a peu pr&egrave;s dans l&apos;ordre :</p><ol><li><strong>R&eacute;gler les probl&egrave;mes de performance</strong> les plus g&ecirc;nants cet &eacute;t&eacute;<ul><li>avoir beaucoup de clients historiques ralenti l&apos;appli</li><li>les mara&icirc;chers sont oblig&eacute;s de choisir entre l&apos;affichage pagin&eacute; pas pratique et l&apos;affichage complet des tables qui est lent</li><li>la liste de produit &quot;d&eacute;sactiv&eacute;s&quot; devrait &ecirc;tre s&eacute;par&eacute;e</li></ul></li><li>Corriger les bugs mineurs qui ne demandent pas trop de travail</li><li><strong>Simplifier l&apos;accueil de nouveau mara&icirc;chers</strong> cet automne<ul><li>forcer l&apos;utilisation de gmail pour &eacute;viter les r&eacute;ponses des clients &agrave; l&apos;adresse &quot;ne pas r&eacute;pondre&quot;</li><li>&eacute;viter que les clients qui font passer l&apos;email d&apos;invitation &agrave; leurs amis cr&eacute;ent un gros bazar).</li><li>autoriser plusieurs commandes par client</li><li>pouvoir prendre la main sur un compte mara&icirc;cher sans avoir besoin de leur mot de passe.</li><li>faire quelques tutos vid&eacute;os</li><li>Mettre en place une seconde instance de l&apos;application, compl&egrave;tement s&eacute;par&eacute;e, pour les nouveaux clients / comptes de test</li></ul></li><li><strong>Trouver de nouveaux clients</strong> cet hiver, assurer le suivi client depuis la France / Ukraine &agrave; partir de mai, &ccedil;a devrait &ecirc;tre nettement plus confortable que de faire &ccedil;a depuis l&apos;autre bout du monde &agrave; Vladivostok.</li></ol><p>Les nouvelles fonctionnalit&eacute;s hors de cette liste d&apos;objectifs (cad la majorit&eacute; des notes dans le <a href="https://trello.com/b/GaZSJzzq/ciboulettenet-roadmap">trello</a>) sont pour l&apos;instant en pause.</p><h2>Fonctions impl&eacute;ment&eacute;es les derniers mois</h2><p>Depuis quelques temps je ne publie plus sur le blog, parce que la publication automatique sur facebook/twitter/mailchimp &eacute;tait d&apos;assez mauvaise qualit&eacute;. Les liens sur les r&eacute;seaux sociaux &eacute;taient r&eacute;p&eacute;titifs et les emails arrivaient directement en spam. Je vais maintenant publier manuellement les informations.</p><p>Donc voici les mises a jour qui ont eu lieu depuis ~Janvier</p><ul><li>La connexion gmail est plus solide</li><li>L&apos;envoi d&apos;email avec sendgrid (quand on a pas de gmail connect&eacute;) indique ciboulette comme expediteur, pour &eacute;viter que les gens confondent votre adresse et celle qui expedie les emails.</li><li>Dans la fen&ecirc;tre d&apos;ajout de client, si vous ajoutez un client existant et cochez la case d&apos;un rendez vous, celui ci sera cumul&eacute; aux rendez vous d&eacute;j&agrave; disponibles pour ce client</li><li>Option pour limiter le nombre de commande pour un rdv</li><li>Correction d&apos;un petit bug avec des liens qui vont nul part dans l&apos;UI</li><li>V&eacute;rification r&eacute;guli&egrave;re automatique des totaux cumulatifs (stocks, compte client, qte livr&eacute;es / qte vendues)</li><li>Ajout d&apos;un syst&egrave;me de monitoring pour &ecirc;tre alert&eacute; en temps r&eacute;el quand l&apos;appli plante</li><li>S&apos;il y a un minimum de commande pour un rdv, autoriser un commande vide</li><li>Acc&eacute;l&eacute;ration de la fen&ecirc;tre de suivi des commandes</li><li>Probl&egrave;me au chargement de la liste de clients</li><li>D&eacute;sactiver certaines sections du tableau de bord</li></ul><p>Voila, comme &ccedil;a ces nouveaut&eacute;s sont annonc&eacute;es.</p><p>J&rsquo;esp&egrave;re que ces informations vous sont utiles. C&apos;est un peu plus officiel de poster ceci sur le blog que dans la mailing liste.</p><p>Bonne journ&eacute;e</p></body></html></div><a class="back" href="/blog"><span>Retourner à la liste des billets</span></a></div><nav id="topMenu"><input type="checkbox" id="toggleMenu"/><a class="appName" href="/">Ciboulette.net</a><div class="grow"></div><a href="/premiere_vente.html">Tutoriels</a><a href="/fonctions.html">Fonctions</a><a href="/tarif.html">Prix</a><a href="/blog/">Blog</a><a target="_blank" href="https://app.ciboulette.net">Connexion</a><label class="toggleMenu" for="toggleMenu">Menu</label></nav><div class="footer"><div class="part"><a href="mailto:renan.lecaro@gmail.com">renan.lecaro@gmail.com</a></div><div class="part"><a href="/cgu.html">Conditions générales</a></div><div class="part"><a target="_blank" href="https://trello.com/b/GaZSJzzq/ciboulettenet-roadmap">Planning des améliorations</a></div><div class="part"><a target="_blank" href="https://uptime.ciboulette.net/">Historique de connectivité du site</a></div></div><script src="/scripts.js"></script><script async="async" defer="defer" data-domain="ciboulette.net" src="https://stats.ciboulette.net/js/plausible.js"></script></body></html>