<html><head><meta charset="UTF-8"/><title>Cyberlégume se réveil en 2020</title><meta name="description"/><link rel="stylesheet" href="/styles/style.css"/><link rel="shortcut icon" type="image/png" href="/favicon.png"/><meta name="viewport" content="width=device-width, initial-scale=1"/><meta name="twitter:site" content="@ciboulette.net"/><meta name="twitter:title" content="ciboulette.net"/><meta name="twitter:creator" content="@RenanLeCaro"/><meta name="twitter:image" content="https://i.imgur.com/KXzgfoT.png"/><meta property="og:title" content="ciboulette.net"/><meta property="og:type" content="website"/><meta property="og:url" content="https://ciboulette.net/"/><meta property="og:image" content="https://i.imgur.com/KXzgfoT.png"/><meta property="og:description" content="Ciboulette.net est un système de Commande en ligne dédiés aux maraichers en vente directe."/><meta property="og:site_name" content="ciboulette.net"/><meta property="fb:admins" content="1136448477"/></head><body> <div class="blogPost"><div class="content"><h1>Cyberlégume se réveil en 2020</h1><div class="intro">Dévelopement à plein temps pour les 2 prochains mois.</div><html><body><p>Hello les cyber-mara&icirc;chers, bonne ann&eacute;e et bienvenue aux nouveaux ! Voici un billet pour vous tenir au courant des avancements du projet et des plans pour 2020.</p><h2>2 ans d&apos;hibernation</h2><p>Voici &nbsp;2 ans maintenant que le projet avan&ccedil;ais tout doucement, parce que j&apos;avais un job &agrave; plein temps en Allemagne. &nbsp;Pendant cette p&eacute;riode, j&apos;ai fait en sorte de maintenir l&apos;application fonctionnelle, mais les demandes d&apos;am&eacute;lioration sont pour la plupart all&eacute; s&apos;empiler dans ma &quot;todo list&quot;. Dans l&apos;ensemble, il n&apos;y a pas eu trop d&apos;ennuies et le logiciel tourne sans mon intervention.</p><p>J&apos;ai d&eacute;missionn&eacute; de mon entreprise pour avoir plus de temps libre en 2020.</p><h2>2 mois &agrave; plein temps</h2><p>Aujourd&apos;hui, je peux me consacrer &agrave; 100% &agrave; mes projets personnels, dont le principal est le logiciel Cyberl&eacute;gume.</p><p>J&apos;ai d&eacute;j&agrave; attaqu&eacute; quelques gros dossiers, donc voil&agrave; en vrac quelques nouveaut&eacute;s :</p><ul><li>Page d&apos;accueil, colonne &quot;Vos clients&quot; : &quot;Clients inactifs&quot; &nbsp;vous permet de <strong>faire le m&eacute;nage rapidement dans vos clients</strong>.<br/><br/></li><li>L&apos;<strong>ajustement des stocks</strong> devrait &ecirc;tre plus rapide. Avant, chaque modification entra&icirc;nait un recalcule des totaux, ce qui n&apos;est pas n&eacute;cessaire.<br/><br/></li><li>Vous pouvez maintenant vous <strong>abonner aux news</strong> que j&apos;&eacute;cris sur ce blog, soit avec le formulaire en bas de page, soit &agrave; l&apos;inscription &agrave; cyber.<br/><br/></li><li>La <strong>semaine en cours &agrave; une couleur diff&eacute;rente</strong> dans la liste de semaines &agrave; gauche de l&apos;&eacute;cran.<br/><br/></li><li>Vous pouvez afficher/masque le <strong>nom du rendez-vous dans les tickets de caisse</strong>.<br/><br/></li><li>Page d&apos;accueil : quand vous <strong>ajoutez un client</strong>, vous pouvez l&apos;ajouter &agrave; la <strong>semaine en cours et la suivante</strong> en cochant les rendez-vous correspondants.<br/><br/></li><li>Les anciennes notifications et logs sont nettoy&eacute;s pour &eacute;viter qu&apos;ils ralentissent l&apos;application.</li></ul><p>En ce moment, je travaille sur un e-mail sp&eacute;cial pour les nouveaux clients, avec un bouton qui dit explicitement &quot;m&apos;abonner&quot;. Si le client ne le clique pas, il ne recevra plus aucun e-mail de cyber. Vous pourrez toujours &quot;l&apos;abonner&quot; s&apos;ils ne trouvent pas l&apos;e-mail, etc .. mais par d&eacute;faut, les clients doivent explicitement exprimer leur int&eacute;r&ecirc;t.</p><p>Apr&egrave;s cela, il me reste deux trois d&eacute;tails &agrave; r&eacute;gler, et je vais commencer &agrave; faire du d&eacute;marchage t&eacute;l&eacute;phonique pour trouver de nouveaux mara&icirc;chers qui pourraient profiter du logiciel.</p><p>Je vous encourage, bien entendu, &agrave; parler du logiciel autour de vous d&egrave;s aujourd&apos;hui.</p><h2>10 mois &agrave; mi-temps</h2><p>Le 22 f&eacute;vrier 2020 je pars pour la Russie. J&apos;y &eacute;tudierais &agrave; mi-temps le Russe. Le reste du temps, je m&apos;occuperais de cyber.</p><p>Mon num&eacute;ro de t&eacute;l&eacute;phone ne sera plus joignable, mais j&apos;aurais toujours les e-mails, &nbsp;WhatsApp et Skype avec une grosse diff&eacute;rence de timezone cependant.</p><p>Je travaille d&eacute;j&agrave; principalement par e-mail pour le support, donc &ccedil;a ne devrait pas changer grand chose au final.</p><p><br/></p></body></html></div><a class="back" href="/blog"><span>Retourner à la liste des billets</span></a></div><nav id="topMenu"><input type="checkbox" id="toggleMenu"/><a class="appName" href="/">Ciboulette.net</a><div class="grow"></div><a href="/premiere_vente.html">Tutoriels</a><a href="/fonctions.html">Fonctions</a><a href="/tarif.html">Prix</a><a href="/blog/">Blog</a><a target="_blank" href="https://trello.com/b/GaZSJzzq/cyberl%C3%A9gume-roadmap">Roadmap</a><a target="_blank" href="https://app.ciboulette.net">Connexion</a><label class="toggleMenu" for="toggleMenu">Menu</label></nav><div class="footer"><form class="validate" id="mc-embedded-subscribe-form" action="https://gmail.us20.list-manage.com/subscribe/post?u=41e9e165060bfc2b465c44f6a&amp;id=607e36af07" method="post" name="mc-embedded-subscribe-form" target="_blank" novalidate=""><input id="email" type="email" name="EMAIL" placeholder="Votre email pour la Newsletter" required="required"/><div style="position: absolute; left: -5000px;" aria-hidden="true"><input type="text" name="b_41e9e165060bfc2b465c44f6a_607e36af07" tabindex="-1" value=""/></div><input class="button" id="send" type="submit" value="Recevoir les news" name="subscribe"/></form><div class="part"> <a href="tel:+336 28 35 01 14">06 28 35 01 14</a></div><div class="part"> <a href="mailto:renan.lecaro@gmail.com">renan.lecaro@gmail.com </a></div><div class="part">           <a href="/cgu.html">Conditions générales  </a></div></div><script src="/scripts.js"></script></body></html>